#  1. Количество элементов, совпадающих с заранее заданным числом (вводится с клавиатуры до ввода последовательности)

n = int(input("Введите количество элементов последовательности "))
x = int(input("Введите эталонное число "))
k = 0
for i in range(n):
    a = int(input())
    if a==x: k+=1
print(k)


# 2. Дана последовательность целых чисел. Найдите разность между количеством элементов, которые больше среднего арифметического всей последовательности, и количеством элементов, которые меньше этого среднего.

n = int(input("Введите количество элементов последовательности "))
k1 = 0
k2 = 0
p = list()
for i in range(n):
    p.append(int(input()))
s = sum(p)/n
for i in p:
    if i>s: k1+=1
    elif i<s: k2+=1
print(k1-k2)
